[
  "If you wanna spend a night hangin’ out with me here’s your chance!  Proceeds go to benefit Burbank Housing, Local Veterans and Fire Relief Victims, the festivities start at 4:30pm on 9/7, and we’ll be in Windsor, CA.",
  "🗣 Say “Flavor!” 📸",
  "I see your 👊🏼🥪 and I’ll raise you a 🏁🏁🐔🥘",
  "🗣 Won’t you take me to... Flavortown?  🗣 Won’t you take me to... Flavortown?",
  "Tune in! 👊🏼🥪",
  "When the flavor is out of this world 🌎 👽🚀",
  "A couple drinks and a 👊🏼🥪, sounds like a perfect Saturday in Flavortown 🍹💥🥃",
  "Camera Guy... get it?!? 😂",
  "Everyone is searching for something...  Help a brotha out and reply with your favorite diner, drive-in or dive in the comments 🤙🏼",
  "Shut the Front Door 👊🏼🤘🏼🔥",
  "In Flavortown we do all our own stunts 💥🔥",
  "Survival of the tastiest 🧐",
  "Hard to bee-lieve we’re finally gettin’ Hunt & Ryde Honey! Head on over to my Instagram to see what all the buzz is about, or comb and check it out for yourself 🐝🐝🐝",
  "It’s a Festival of Funk 🤙🏼🍟🍗",
  "My brotha, great win... just let me know when we are cookin’ that monster up! 🦞🔥",
  "Workin’ on some new recipes for the folks inside Area 51 👽 The Radioactive Ribs are lookin’ goooooood 🔥🔥🔥",
  "Nachos so good you’ll eat em out of a Trash Can 🗑💥",
  "Find someone who looks at you the way I’m lookin’ at that sandwich 😍😍😍",
  "Check out the action:",
  "Favorite tweet so far... What do you all think? 🤔",
  "Don’t miss the new season of Fast N’ Loud! First episode premieres tonight at 9pm EST 🔥🏁👊🏼",
  "We got no troubles 🦞 Life is the bubbles 🐡 Under the sea 🐠",
  "Don’t be afraid to make mistakes. If you're cooking and not making mistakes, you're not playing outside your safety zone. 🚧",
  "Happy Fourth of July everybody!!! 🇺🇸 Enjoy the Fieriworks tonight 😂",
  "If you let kids do fun stuff in the kitchen, they’ll develop skills and interests that will stay with them forever. 🍔🍔🍔",
  "Hahaha DJ Triple-D on the ones and twos",
  "Thanks for havin’ me brotha! Great show, great times 🤙🏼",
  "This sandwich is so packed with flavor they actually MADE the thing with a flip flop! 😂🥪",
  "Seriously awesome stuff right here!",
  "Look Good, Feel Good, Play Good",
  "Winner winner chicken dinner 👊🏼",
  "Tequila Regulators... Mount Up! 🤜🏼🤛🏼",
  "🤔🤔🤔 might be on to something here",
  "This is going to be DYNAMITE 🧨🧨🧨",
  "Check it out!",
  "Thank you brutha!",
  "Guy Fieri gets his star on the Walk of Fame",
  "Who is the real “Guy”?  The Mayor of Flavortown Or The French and Italian Guy  🤔🤔",
  "Lost a great friend today.  Johnny Wise We will miss your energy, laugh and friendship.  RIP Wise One!",
  "So stoked for you to check out my new Knuckle Sandwich knives...ready for pre-order now!! These are the real deal!",
  "Gotta love BBQ KING",
  "You guys don't wanna miss this!! Get your tickets now -",
  "Man, this show’s gonna be nuts! Check it out -",
  "Our llama on goat security at the ranch",
  "AhhhhhhhhhVacado! We planted these avacado trees three years ago and this is the first one!",
  "Fieri family tradition. Christmas Eve dinner. Homemade pasta and crab. Merry Christmas everyone.",
  "Big congrats. You rock.",
  "The volunteers made it happen today. Sure makes you proud to be a member of the Northern California community!!",
  "HuntRyde Ranch herd",
  "Nice hanging with Station 8 crew in Salt Lake City",
  "Lookin' forward to the big event tonight",
  "Now that would be a tasty race!",
  "My puppy Smokey. The chihuahua daredevil. WTH!",
  "Thanks to all the hard working community members of Flavortown. It was a delicious campaign and we are rollin out for another 4 years.",
  "Omg! Great to see my brutha Guy and my other brutha Guy and my other brutha Guy.......... Gonna be a crazy family reunion!!",
  "Big thanks to the Knuckle Sandwich team for being out here in Middletown for Day at the Mansion Fire Relief Benefit! VIP tickets still available at the door",
  "In Texas and decided to trade in 600hp for one bull power",
  "My brutha Boss man! We miss you! You are one of a kind. Namaste",
  "I am not a big kitchen gadget guy but a good thermometer is key.  This Mavick XR50 is awesome. (no I’m not gettin paid for this lol) 4 probes, wireless remote goes 500 ft, the list goes on!",
  "Happy birthday to my sister Morgan, we miss you! NAMASTE.",
  "My brutha Lukas is makin’ it happen! Check this out -",
  "Sitting with two North Bay heroes! Luz, a firefighter in Lake County and Evelyn Cheatham with Worth Our Weight.",
  "One of the greatest!! Rest In Peace Bandit!",
  "One of my fav New Orleans party bands COWBOY MOUTH Check out the video",
  "Big thanks to the Cattlewomen of Humboldt for a great beef donation for the Redding evacuees!",
  "Spent the day hangin’ with the fam in Jamaica!",
  "How cool! First time our peacocks have had baby chicks on the ranch",
  "Happy Birthday America. The greatest country on Earth 🇺🇸",
  "Check it out!",
  "It’s game time 🔥🔥",
  "Congrats to my favorite Warriors fan and 6th grade graduate, Mr. Ryder Fieri. Love ya Snocks. So proud of you!!",
  "Happy birthday Loretta! Hope your bday was awesome. The numbers do not add up, you make it look easy.",
  "Yeah!! 🔥🔥🔥 congrats to the Dubs!! Year 4 here we go!!",
  "Thanks to the men and women who made the ultimate sacrifice to keep our country free. We are the greatest country in the world. Let's keep it that way.",
  "Huge carrot we just pulled out of the hunt ryde ranch garden!!",
  "Awesome to be a part of it - thanks mucho for everything!!",
  "Conspiring on a new album and cookbook",
  "Don't miss Mama Cozza's",
  "Glad ya dig it",
  "Awesome time today brutha!!",
  "Jay’s the best!!",
  "Takin recommendations of things to do with the family on the Big Island",
  "hahaha... tryin to keep you judges on your toes",
  "Great spot...glad ya made it in",
  "Awesome",
  "Ya gotta try the Motley Que and the Bloody Mary... enjoy!!",
  "Our awesome culinary team works with local charities and organizations in Sonoma County to donate the perishable items throughout filming !!",
  "its actually a Camaro...",
  "One of my favorite chefs Benny Lin, from Pagoda Restaurant in Alaska, came down to Cali to cook with me today",
  "Gonna be a wild show!!",
  "Haha",
  "Happy Anniversary!!",
  "Miss my lil sister Morgan today and everyday.  You are one of a kind NAMASTE!",
  "Getting ready to fly with the LAPD! So cool!",
  "Thanks for all the birthday wishes yesterday! Half century is starting off great!",
  "Big boss of the goat herd",
  "Horses out and eating the lawn at the ranch",
  "Merry Christmas Ryder!!",
  "Thanks! hope ya dig their shows!",
  "You bet...really appreciate it!",
  "Definitely was !!",
  "You think these guys were nervous?? I’m putting my name on this!",
  "Who are ya rooting for?",
  "Happy 75th birthday to my dad.  Thanks for being an amazing friend, mentor and father. You amaze me everyday !!",
  "So proud of our military and our veterans. Freedom isn’t free and it’s because of our brave men and women & their families we have freedom",
  "Nope... just great chefs comin together to cook great food",
  "It’s gonna be unlike anything you’ve ever seen before!",
  "Awesome, thanks for tuning in",
  "Agreed",
  "Awesome, see ya there",
  "Appreciate it!",
  "Glad ya liked it!",
  "Thanks brutha!",
  "Awesome!! Thanks!!",
  "Just be who you are, the viewers can tell when you’re not being authentic",
  "Big salmon goin to the smoker.  Oh yeah!!",
  "Been a long 10 days since the fires started in my hometown & we've done a lot of good, but the need is still growing",
  "Happy birthday to my little sister Morgan who would have been 45 today. Love you and miss you Namaste!",
  "Fresh honey from the ranch",
  "Great to hang out with my parents and cousins in Columbus",
  "At one of my fav taco joints in cabo.  Asi y Asado new location.  Killin it",
  "Garden is outta control this summer! Check out this red okra we planted",
  "Who is...",
  "Hell yea!!!",
  "Congrats to my mom and dad on their 50th anniversary!!",
  "Gotta dig spring time in nor cal. Beautiful cauliflower and artichoke out of the garden.",
  "...buy a beer for a fallen soldier & we're gonna donate $1 for each bottle purchased to this organization aimed at ending veteran suicide",
  "Hell yeah!!!! Congrats!",
  "think ya got what it takes?",
  "Our dog roxy.  A little dog yoga?  Wth!",
  "Best Tahoe vaca. Boarding, laughing, cooking and hangin with the family. Doesn't get any better!!",
  "Right on!!! Glad ya are diggin the food and havin fun on the cruise!!",
  "Awesome!!! Glad ya stopped by!!",
  "Whoaaaa  Peacocks firing up at the ranch!!",
  "Prepping the ground at the ranch for the big organic garden!",
  "Hope you have an off da hook birthday!!!",
  "great hangin with you guys!",
  "Miss my sister. Such a wonderful giving, caring, loving mom, sister, and daughter. Namaste Morgan",
  "What is happening?!?!",
  "YESSSS!!!!!!!",
  "Happy birthday to the greatest 11 year old I know.  Love you Ryder!!!",
  "This is how my day started. Epic!",
  "It's holiday time and the boys are makin cookies.... I mean eating the dough. Wth?",
  "Lookin forward to takin all these bikes and gifts to various organizations here in Northern California !!",
  "Each year gets better - we ask our kids to think about others and shop for toys for others not as fortunate as we are",
  "4 more days...",
  "Total class acts - best group to kick the holidays off with !!",
  "Happy to be here!",
  "Coach Benbow is an amazing coach. He's the real deal and your votes will help bring money to a great school",
  "Sunrise at the ranch this morning. Wow.",
  "Ya gotta try this crazy-simple recipe for Roasted Spaghetti Squash with Kale and Parm toni",
  "Wrappin up our last day in Barcelona. Great trip",
  "Happy birthday to my sister Morgan. Love you and miss you. Namaste",
  "Ohhhhh old school paella in Cava Spain!! So crazy",
  "Octopus fishing off the coast of Barcelona  Doesn't get any fresher !!",
  "had a great dinner and hysterical conversation!",
  "openin today!",
  "Mushroom, red onion, ricotta and lemon zest homemade pizza w/ the 2013 Hunt & Ryde Pinot N",
  "Sunrise at the ranch. Gonna be a great weekend",
  "In my hometown of Ferndale. The hike in Russ park is amazing",
  "Yea!! Barrer BBQ wins Grand Champion at the Humboldt County Fair Surf & Turf BBQ Competiti",
  "Humboldt county fair surf & turf Bbq competition is in full effect - tryin instagram stories for the first time today so ya can follow along",
  "Humboldt County Fair Surf & Turf BBQ competition is kickin off",
  "spent the day cleanin out the garage and came across this blast from the past. The day we",
  "Yeahh! Gonna be a great show!",
  "Really diggin the cover of my new cookbook “GUY FIERI FAMILY FOOD\"! Pre-order at",
  "NYC - Atlantic City - Mt Airy ... gonna be a great week!",
  "Gonna be a great event! Hope to see ya there!",
  "The Groceryland board game makes its debut tonight !",
  "On one of my favorite trails at Russ Park in hometown Ferndale. Cowboy leading the way!!",
  "Happy 4th everyone!!",
  "The Fieri Family Tortoise Herd",
  "Cowboy and Roxy on a big hike this morning at the ranch",
  "Ranch life...doesn't get much better!!",
  "Green Elephant Vegetarian Bistro & Bar - one of the best vegetarian meals I've had in a lo",
  "Tri tip on the Carson Rodizio.  Nuthin like rotisserie on memorial wkd! Thanks to our vets for keepin us safe & free",
  "We lost the little lion of our family, Rockstar. RIP monker dog. Our family will never for",
  "Epic!!",
  "And the security team!!",
  "Here's my goat herd mowin down the fresh grass at the ranch. Kewl!",
  "One of the coolest places inside of an old crater. Maui sporting clays. Dave Barnes is an",
  "If ya hit Maui it's worth the drive 1 1/2 hr  to check out the crater!!",
  "Whoa what a trip to the Haleakala Volcano. It was raining down below but once we drove thr",
  "Gotta dig the huge fresh strawberries at the resort in Maui!!",
  "My Mamee and me circa 1982",
  "Not the best picture by Ya gotta check out Paella Tapas next year. Whoa",
  "Life is short, appreciate every day, and tell your friends and family you love them. Reall",
  "The beginning of a two year cheese journey. We WILL be back to get this one. See the begin",
  "This is it!!! Hope ya join us tonite for the start of our European adventure 18 years in t",
  "Tomorrow is a big day. Hunter has grown up on Triple d and Guys Big Bite. So proud with ho",
  "Sharin some photos this week that you haven't seen before from our trip to Europe. Tune in",
  "Quantum Mechanics is one of my staple cookbooks too",
  "everyones gettin in on this!",
  "hahaha! thanks my brutha",
  "yea !!",
  "Addin one of these to my list of things I definitely need !!!",
  "Just had off da hook pho at this little joint in Modesto. Awesome food, nicest family. Ya",
  "Shrimp and perigord truffle risotto tonite at the house",
  "one of last nites bbq chicken pizza",
  "The crowd on the ship is goin crazy for the burgers. And man these cooks work hard  Over 2",
  "6 hour lobster bisque  Omg",
  "Lotta lobsta for tonight's big dinna",
  "not gonna want to miss this!",
  "Having my favorite!  Truffle rav. Ohhhhhh it doesn't get better ! Happy holidays.",
  "Merry Christmas!",
  "the krew at Guy Fieri's American Kitchen + Bar in the Cancun Airport! Opens today and these guys are ready to rock!!",
  "takin it up a notch with Smoked Prime Rib and Lobster Hushpuppies for the holidays on a ne",
  "BIG news today - website is live for   and we’re offering 20% through Friday - use HUNTRYDE20",
  "hope ya had a good Thanksgiving! resharin this recipe for a outta bounds leftover idea",
  "Happy thanksgiving everyone !!",
  "really proud of this spot - ya gotta check it out!",
  "Yeahhh. You guys rock!",
  "Happy 73rd birthday to my hero, my dad!",
  "miss ya brutha",
  "in case ya missed it",
  "yeahhh ! happy halloween !!",
  "Had to follow up with a shot on the grill. They are 28 day aged, cooked on hickory and oak.",
  "Gonna be outta bounds!",
  "Pit beef on the grill",
  "Cookin pit beef outdoors",
  "temperatures startin to drop . heres a hearty risotto recipe to try out this weekend!",
  "Crab aftermath !!",
  "these guys are wild !",
  "workin on the edits for the new cookbook on a warm October day in Nor cal. Not bad!!",
  "killer view of The Manitou Incline at pikes peak. So amazing and wow the altitude gets ya.",
  "My mom and I at Centerville Beach in Ferndale. If ya ever get a chance ya gotta see it. Amazing place.",
  "Family is reunited after three weeks and 7 countries! Such an amazing journey with my son!",
  "Alright... Guess where we are now?!",
  "Leaving Italy!!",
  "So proud to be the father of two of the greatest kids in the world.",
  "Handmade Tagliolini, pancetta and fresh peas   Soooo simple but the best dish I have hand on this euro tour. Omg!",
  "With Father's Day comin up this weekend, I wanted to share three of my ultimate recipes",
  "Rome was a blast!  Off to Parma!",
  "Amazing lobster off the coast of Greece. Whoaaaa",
  "Peace out California! Hunter and me are headin overseas - 4 weeks and 7 countries",
  "An amazing day. So proud  of my son Hunter James! 2015 graduate!!",
  "Just went lobsterin in Chatham mass!!",
  "Today we honor, remember and thank the men and women who sacrifice to keep our country the land of the free",
  "Roasted tomato and red bell pepper sauce cooked over oak! Killer!",
  "Yeahhh! Can't wait !!",
  "Phat chops on the grill. Brined with garlic, jalapeño, cilantro, salt and agave nectar.....prime time!",
  "Yeah!!! for my first instagram post, wanted to throw it back to where it all started nine years ago",
  "grillin some fresh lamb this weekend . no matter what your celebratin, this recipes a winner!",
  "my vegas spot has got a brand new instagram look - ya gotta follow to see whats cookin",
  "Johnny Garlics Bakersfield is OPEN for business. so kewl to be a part of the Bakersfield community",
  "One of my fav joints in south beach. La sandwicherie!  Ask Chef Ruiz for the frenchie",
  "RIP Mike Hardin \"boss man\". You helped the world in so many ways. We will miss you everyday",
  "swap in broccoli and fennel with greek yogurt for a twist on regular slaw",
  "Gotta share this epic time lapse video of the sunrise and fog comin up over the ranch",
  "kids will be kids & accidents happen. Learn how   keeps our kids safe.",
  "Real Deal. Old school prime rib. Merry Christmas everyone. So much to be thankful for!!",
  "6 turkeys 2 hams and some amazing kale from the garden. Gonna be a great thanksgiving!",
  "Big congrats to Jennifer and Ernie who got engaged tonight at Guy Fieri's Chophouse in Atlantic City",
  "The bronze Fonz in Milwaukee. Eeeeeyyhhhh!",
  "Killer porterhouse steaks at the lake. PRIME TIME!",
  "Cookin some unbelievable nor cal red abalone at the lake. OMG. The best!",
  "Check out my killer new single serve coffees at  . For my fans onlybuy 3 to get the 4th free with coupon code GuyFan1",
  "Eric lindell gettin ready to rip it up at the Exit In in Nashville tonight. Ya gotta check it out",
  "my bro lindell just released a rockin live album with some of my  all time favs. Yeah!!",
  "Remembering those who gave their lives for our country-a big thank you to all the men & women in uniform & their aint free!",
  "Pre-order a signed copy of the new cookbook, GUY ON FIRE, on sale 5/6, yet?",
  "OMG lookin at the first copy of my new book in my new restaurant in vegas. What a day!!",
  "Find out more about all the amazin work Cooking With Kids does at   !",
  "Preorder a signed copy of the new cookbook, GUY ON FIRE, on sale 5/6   or",
  "Caddyshack, Stripes, Animal House, Vacation, Meatballs...Harold Ramis made me laugh like no other.  He will be missed.",
  "Nothin better on a Saturday night then spendin it with the fam",
  "If ur lookin for a killer tailgate party in NY/NJ on Sunday, I'll be here...check it out:",
  "Cookin' it up big time for a new season of Guy's Big Bite...ur gonna dig it!",
  "Cheers to a rockin' evening and a Happy New Year, everybody!",
  "Cookin' it up in Vegas today with the team...restaurant is gonna rock!",
  "Wanna cook it up on GGG? Click here to find out how...",
  "Ohh yeah...Alexander Valley truffle company showed up with 2 lbs of white truffles from Italy!",
  "Some friends of mine found my salsas in Roatan, Honduras...dig it!",
  "Big day with the Johnny Garlic's opening team at The Streets of Brentwood...opening Dec. 9!",
  "My buddy tyler scored  3 killer abalones off the coast of Mendocino.  Good eatin tonight !!",
  "The DDD krew shootin in my hometown of Ferndale...",
  "Freedom ain't free. To all veterans past, present and future, thanks for your service.",
  "Sad day...lost one of the greats...chef Charlie Trotter will be missed.",
  "Congrats to Mark and Mia who got engaged at Johnny Garlic's in Dublin...yeah!",
  "Get ready for this shop and cook till ya drop cooking competition coming Oct. 20: Guy's Grocery Games !",
  "One of my favorite chefs in the Sonoma County wine country,  John Ash, has a new cook book out. Check it!",
  "thanks everybody! stoked on a million followers today!",
  "Big weekend at the lake with tha family...hope you all have a great Labor Day holiday.",
  "JC Stroble from The Beacon, a true DDD legend and a great guy, will be missed",
  "The Fieri organic garden is on fire...this pumpkin's gonna be huge come Halloween!",
  "Get ready for Rachael vs Guy Kids Cook Off...ur gonna dig it!",
  "Diggin' Hermosa Beach with the family...great place",
  "If you haven't yet, please check out my facebook page at  . Dig the likes!",
  "In Eureka Ca with the fam. Just had some killer east coast slices of pizza at Paul's live from New York.",
  "Great to see my hometown grocery store, Valley Grocery in Ferndale, carrying  my bbq sauce, salsa & wing sauce!",
  "Don't forget to hook ur dad up w the newest DDD book...full of great spots and classic commentary from the krew...",
  "My new DDD book full of rockin recipes & stories from my Krew ...get it for Dad!",
  "Gettin ready to play some touch fball w Tom Brady & my Best Buddies.  May 31, Harvard Stadium. Check it out...",
  "Gotta dig  fan John Robe's tattoo w his kid's names...Dreyson, Davis & Danika...his own personal DDD!",
  "shootin' some killer San Fran joints this week for DDD...Nor Cal rocks",
  "ya gotta check out these two dudes...i've seen em tossin' pizza skins and they are off tha hook!",
  "check out more killer DDD joints than ever in my all-new book: DDD The Funky Finds of Flavortown.  Get it here",
  "Makin  Bananas foster Ebelskivers for Mother's Day!  Big props to all the moms. You are the best",
  "Headin' north to Portland to check out some new DDD spots.  Hopin' for clear skies!",
  "For National Pretzel Day plz check out the Awesome Pretzel Cart and my foundation, CWK...",
  "off to vegas for a few hours...got some good stuff cookin'",
  "Check out the new DDD book...the Funky Finds In Flavortown...preorder here!",
  "Big time spring weather in Sonoma County...80 degrees!  Gotta get out for a hike at Annadel State Park",
  "Hunter and I rollin to UFC in San Jose. So stoked!",
  "Off to a rockin start at the NEW Johnny Garlic's in Sacramento.  Great job by the entire team!",
  "Big game for Ryder today...go Rockies!",
  "Big props to Ryder for killin it at his first Little League game...so kewl to see him out there",
  "Had an amazing time with tha fam at Amanyara, Turks & Caicos.  Everyone was amazed how blue the water is.",
  "Check out the new DDD book...the Funky Finds In Flavortown available 5/18...preorder here!",
  "Plz check out my foundation, Cooking With Kids (CWK on FB)...workin' on some great ways to get kids cookin'!",
  "40 lbs of killer corned beef.  8 day brine.  Potatoes and cabbage to follow.  Happy St. Paddy's Day...goin' big!",
  "Rollin out of South Beach. Ziggy Marley was so off da hook last night for the big closing party.",
  "Yeahhhhh gotta dig the seafood tower at Joe's Stone Crab   If u haven't been here, ya gotta check it out.",
  "Gotta dig SoBe Wine & Food. Wrapping it up tomorrow night w Ziggy! Check it out on songkick.",
  "Had the pleasure of meeting Gov. Bob Miller of Nevada...stoked to read his book...",
  "Sick new cruiser from the krew at Globe Shoes. I am gonna need a helmet for this one. Faassttttt!",
  "It's dark at the Super Bowl.  So weird",
  "wow, what a great bday. thanks to all for the tweets, emails and txts. i'm really blessed to have such great friends, family and fans!",
  "Out for a golf outing with the krew.",
  "Off the hook fresh seafood selection at Milo's in NYC.",
  "Wow. What a great year. So much thanks to give.   Hope you all have a blast tonight. And big happy bday to my son Ryder whoturned 7 today!",
  "Havin' an amazing time in St. Barths. Yachts of every shape and size...some with helicopters! Nutz!",
  "I hope everyone is having a great holiday. It's been a blast at the Fieri the newest member, Roxy",
  "Just hit LA to shoot some triple d joints. Also gonna  visit a few spots we've shot in the past like Baby Blues BBQ...killer greens!",
  "Pork butts Hittin the Horizon Smoker early for BBQ Black Friday.",
  "Hope everyone had a great thanksgiving. Had a blast with family and friends in Ferndale. Cooked 8 turkeys ! !",
  "Packin' up the family for big Thnxgvng of cookin' & dirt bikin'.  Thanks to everyone for their support this past week.  Happy Thnxgvng!",
  "Freedom Ain't Free!  Thanks to all vets past, present and future for protecting us and giving up their own freedoms to preserve ours.",
  "Ya gotta check out my crazy family in the new FN Special, Guy's Family Reunion today, Nov. 11, 12/11c!",
  "Shootin triple d up in Seattle.  Kind of a clear day, u can see Mt. Rainer. Some killer joints ya gotta check out",
  "Diggin' all tha costumes, Guys!",
  "Just took the boys trick or treating and we got rained on big time. We had 3 ninjas, Thor, a gorilla and a mummy. All soaked to the core.",
  "Good luck to Motley Que Crew at The Jack Daniels Invitational this weekend!",
  "Gettin dirt bikes cleaned up. Hunter has a four day weekend and we r gonna go riding.",
  "My team Motley Cue gettin the ribs ready for the American Royal Open BBQ comp. Returning 2011 Grand Champions!",
  "happy birthday to my little sister Morgan. Today would have been your 40 th birthday. We love and miss you! NAMASTE. g",
  "You guys diggin' tha new website? Check it out...",
  "Wrappin' up some killer outdoor shoots for Guy's Big Bite...gonna be a great season",
  "If u haven't checked it out yet, cruz by Guy's American for some football and rockin' food this weekend! 220 W. 44th, NYC. 646-532-GUYS",
  "Killer pinot noir  grapes ready to be picked Sunday am at Hunt-n-Ryde Vineyard...",
  "Introducing Tex Wasabi's newest bartender...Brooke Shields! Keep an eye out for her on Guy's Big Bite this Fall too.",
  "Guy's American Kitchen+Bar is open for biz! 220 W. 44th, NYC.  646-532-GUYS",
  "Training the front of the house crew at Guy's American Kitchen and Bar. Awesome group. We go live Monday!",
  "Just shot a great joint \"Funk n Waffle\" in Syracuse   The owner Adam is in this band. Checkem out. Kewl tunes",
  "More signage...",
  "Oh yeah the signs in NYC are goin' up!",
  "Just like a true Fieri...a desk right by the teacher.  Congrats, Ryder, on starting the 1st grade!",
  "My 6 yr old Ryder went out to the chicken coup to get the eggs and the Rooster came after him. He was scared, but didn't drop the eggs!",
  "At the house I grew up in in Ferndale, Nor Cal...I learned to cook on this stove...gas on right, wood burning on left!",
  "What a cool way to end a 16th birthday bash. Mötley Crüe and KISS   Hunter u da man !",
  "So cool. Just received my drivers ring for driving the pace car at the Indy 500.",
  "Big day today...Hunter's turning 16...can't believe it.  So proud of him.",
  "The first egg from our organic chickens.  Started as lil chicks and finally the eggs arrive. Rooster may have to go!",
  "Tha new website is gettin' ready to launch.  Comin' soon!",
  "Checkin out the Wright Brothers memorial in Kill Devil Hills, NC with Jules and Hunter.",
  "The krew at Harris Teeter rollin the bbq sauce. Awesome !",
  "On Colington Island by Nags Head NC goin crabbin with Lori and some of my cousins.",
  "My bro CDR Michael \"Dano\" Bratley,pilot that flew me onto the USS Enterprise in Persian Gulf in 07.",
  "My krew kickin' ass to get Guy's American Kitchen & Bar NYC ready to rock Sep 2012!",
  "Just rolled through Poplar Branch NC and stopped off at Dennis Anderson's Grave Diggers dungeon diner.  Kewl!",
  "Whooaaa!  Just went 159 mph in this wicked boat on Lake of the Ozarks",
  "Check out what is going on over at our facebook page:",
  "Next time u r Rollin thru Eureka Ca ya gotta check out Brick & Fire.   Killer wood fire pizza !",
  "Chillin' with da fam at tha lake",
  "It is outta control at the X games. Step up competition is breaking record after record. At 45 feet right now.",
  "Long days on tha set of Rachael vs. Guy: Celeb Cook Off but ur gonna love it!",
  "It has finally arrived. The HULI HULI chicken machine has arrived from my bro Reno at Fresh Catch on Oahu. Killer!!",
  "Ohhhh this Whole striped bass with spicy ponzu at Katana in West Hollywood is the bomb!",
  "The over hang rock at Glacier Point in Yosemite. 7200 ft. Hunter and I took the mi hike down to valley floor.",
  "What a kewl view to wake up to in Yosemite.",
  "Big tasting yesterday with tha krew for some new sausage flavors and the final versions of my pasta sauces.  These are gonna b great!",
  "Just got to Rhode Island to shoot triple d. Took a cruise around town and up to the capitol",
  "Settin records at the Indy 500.",
  "The first pace car drivin at Indy. So I guess at this point u cud say I was in the first and last (for now)",
  "In Indy. On the way to the track for pace car training.   Wow gonna be a wild weekend",
  "Best part of my gig is helpin' out my restaurant bruthas and sistas...check it out...",
  "At sfo and the eclipse happens. Dude puts a pin hole in one piece of paper and it shines silhouette on another. Awesome",
  "Yeah. Rollin through Bean town with Mayor Menino and enjoyin some great food at Italian Express Pizzeria",
  "The Fieri family turtle \"Pops\" was the size of a baseball when we got him. 10 year later 35 lbs!",
  "On the way to San Jose to open the new Johnny Garlic's...u gotta get there...",
  "Rain is gone so the gorge at Annadel state park is open for a hike. Gettin over the boulders is a peach",
  "Back in NorCal and ready for a weekend with da fam.  85 degrees in the Wine Country...gotta dig it.",
  "Check it out...Motley Q Crew BBQ   is gonna b makin' some big time q at the Kingsford Invitational!",
  "Training with rockin' new team members at Johnny Garlic's San Jose opening soon!",
  "In Monterey for Pebble Beach Food & Wine",
  "My Hawaii triple D stunt double, Kenny D. at a sweet spot on the east side of the island. Sweet Home Waimanalo.",
  "On the North Shore with the knife making master Ken Onion.",
  "The Triple D krew shootin  at Opal Thai in Haleiwa on the North Shore. U guys r gonna love this joint",
  "Hunter n I just hiked Koko Head in Hawaii Kai, outside of Honolulu. 1080 railroad tie steps up. Wow What a killer view",
  "My brutha Irvine.  See u soon in Cali for the big day!  I'll send some pics",
  "Opening a new Johnny Garlic's in San Jose on May 2nd.  You are gonna dig the new menu and layout.",
  "U gotta check out my brutha Eric Lindell's new album comin out in April...dude rocks!",
  "New menu at Johnny Garlic's locations rollin' out soon...keep up to date on FB",
  "60 lb of corned beef.  Cookin it up for a big feed at the Fieri casa.   How u guys cookin it up?",
  "...more cookware...",
  "Housewares Show was off da hook...dig a few shots of my cookware collection...more to come!  Green for St. Patty's!",
  "1970 Fiat 500. 2 cylinder. 18 hp. And my 6'8\" manager Reid. What. A combo !",
  "First dish bein' cooked up on the new Guy Fieri Stainless Steel Cookware!",
  "Cookin' with Sammy Hagar at the casa for Guy's Big Bite!",
  "Cookin up some nice veal chops for a lil Sunday dinner.",
  "Can't wait to unveil my new cookware in Chicago at the Housewares Show...5 full lines!",
  "SOBE is rockin. Doin the Paul &Young Ron Celeb Cook-Off and some dude comes up with a pic from last year on a CC",
  "Big ol mess of frog legs that Chris from Scullys Tavern made 4 our airboat shot triple d at his place 4yrs ago",
  "Gettin ready to rip it up again with the crazy crew from airboat assoc of Florida",
  "Gotta dig packin' for the warm weather comin' at South Beach Wine & Food Fest.",
  "ON my way to SFO and the fog in Sonoma county is thick!",
  "Hunter n my nephew Jules r cookin me a 4 course dinner .On their own with a little advice from my dad. My bday gift !",
  "Ya gotta come check out Pebble Beach Food & Wine...rockin good time..tix on sale...",
  "Hikin Annadel state park again. Killer weather for Feb. rain yesterday, Sun the next",
  "Workin' on tha new website today...comin' along strong.  Stay tuned for the launch.",
  "On a hike in Annadel state park in Santa Rosa. Nice big ol 'gang of wild turkeys just hangin out",
  "Workin' on some new restaurant recipes with the culinary team today...big news comin'",
  "Giants win. Congrats !",
  "Our waiters Martin and Shabo and some phat steaks !",
  "Havin dinner at Peter Luger    In Brooklyn. Really kewl people and righteous steaks",
  "Katz deli on the lower east side of nyc. The bomb pastrami !",
  "Goin' big in Vegas for some Runnin' Rebel style DDD...",
  "Killer b day cake from my bro Duff at Charm City Cakes.",
  "Festivus Caddyshackus Maximus, my bday, officially begins with my brutha Blazy and Kenny Loggins himself....check it",
  "Kewl",
  "Favorite celeb on Rachel vs Guy?",
  "Guess who rolled up on the set of triple d in Georgetown Texas?  Wow. Sweet 81 Z28!",
  "Name of a sandwich at a joint called the Noble Pig in Austin. .....???  Wonder where they got that kewl name? Lol",
  "Gotta dig it. Shootin triple d and who is at the counter? Rocker Jimmie Vaughan and his wife Robin. Kewl dude",
  "Just rolled into Austin to shoot some triple D.  This place rocks the music and the food. Wait till u see these joints",
  "That niner /  saints game was off da hook. Right down to the wire!  Congrats to San fran",
  "Still waitin' on snow out here in Cali...gotta get up to Tahoe for some boardin'",
  "Just saw the new packaging for my cookware line coming out in March...wait'll you see it!",
  "Ryder is turnin' the BIG 6 on NYEI can't believe it.",
  "Gearin' up for some dirt bikin' with Hunter this weekcan't wait to see him on his new KTM 250",
  "Kewl to roll through my local Costco and see they're carryin the tequila lime sausage and rosemary peppered tri tip.",
  "Good day cookin' it up with the team members at Johnny Garlic's in Santa Rosa",
  "Oh yeah. Cookin up a nice prime, prime rib and this tasty snake river farms Kurobuta ham. A Fieri Xmas feast!",
  "Hope everyone is having a great Christmas! Wow. This is the gift of the year. Just needs blonde sprouts!",
  "The resolution recognizes every Sunday in the state of California as\"Cooking with kids day\"  Next goal, we go nationwide !!",
  "Just got a kewl framed copy of the \"Cooking with kids day\" resolution that I worked on with Calif Senator Cannella.",
  "Can't wait for my new show launch, Rachael vs. Guy: Celebrity Cook-Off, on Jan. 1.  Check it out!",
  "Check out my new signature line of jewelry from Room 101...ur gonna dig it!",
  "The new   website is comin' along strong...you're gonna dig it",
  "Hangin' at Kendall Jackson today...rockin' Sonoma County wines!",
  "Hunter and Ryder are donating some  bikes and toys to the fire department toy drive...love to see them excited about helping others.",
  "Rocked tha Zenergy Works - SEO Company Holiday Open House last night.  The occupy cubicle took 1st prize.",
  "Gettin ready to rock the View with Rachael Ray. Talkin about our new show comin out jan 1st!",
  "Ya gotta check out the special edition of Diners Drive Ins and Dives tonight with Kid Rock. A couple of his fav joints and his brewery!",
  "Watching some football and slow cookin some ribs on my Carson gotta check this thing out. It is so money!",
  "Just landed back in San fran. Long road trip. 11 days. 7 triple d locations in Minn. And 7 in Dallas 7 triple d.  U guys r gonna dig em.",
  "Brutha U got it. Can't wait for the Rachel Vs Guy celeb cook off. Jan 1st.",
  "So kewl to have Hall of Fame Houston Oiler running back, Earl Campbell on Triple D.  Been a fan since I was a kid.",
  "In Arlington Tx shootin triple D and one of my all time football heroes from my childhood just walked in.  Wow. Outta bounds.  I'll send pic",
  "Found kewl new APP called SONG KICK CONCERTS  It reads ur music library and tells ya when ur fav bands r playin in concert. Check it!",
  "Big game against the Fortuna High Huskies. Tough battle but Cats win and move on to the NCS D4 championship game. Wow. Congrats !",
  "Big props to the Ferndale Wildcats for winning the",
  "Kewl tattoo I saw on a chef at a rockin Italian joint called Broders'",
  "Check out my buddies Ergo!",
  "Outta bounds. My buddy Gary hooks us up with 2 / 30 lb salmon. Cooked em up with ginger, lime, garlic,soy. So fresh",
  "5 birds brined, rubbed, trussed and ready to roll",
  "Heatin up the Horizon smoker gettin ready to cook it up for 40 friends and family. All outdoors. Hope it doesn't rain",
  "Firing up the grill and smoker for t day rainin like crazy up here in Ferndale. Cookin 5 big birds and 2 prime ribs.",
  "Already gearin' up for a Thanksgiving trip with the fam and the Krew...4 organic turkeys, two prime rib roasts and two hams to start....",
  "Big meeting today for a huge new restaurant project...stay tuned!",
  "Fall is finally settin' in here...gotta get a  hike in before the rain.  Annadel State Park here in Santa Rosa is da bomb",
  "Wrapped up a kewl photo shoot for some more foods comin' to your local grocery and club stores. Wait 'till you see tha cheeseburger sausage!",
  "Twitter / Guy Fieri: Had to swing by and see my ...",
  "Hoppin' the train to New Jersey to visit all my peeps at Kraft...lookin' forward to cookin' it up with them",
  "Back in Baltimore...so many great joints...gotta hit Chap's for some Pit Beef",
  "Wow. What a day. Joe Theisman just did a cameo on Triple D in Baltimore",
  "On the field for the 49ers Redskins game. Crazy seein nor cal team play on the east coast.",
  "at the metropolitan cooking and entertaining show in DC  Hunter is gonna make a cameo. The event planners gave free tix to 2500 spouses",
  "Today is gonna rock. Doin a demo for the spouses of deployed soldiers",
  "Just landed in DC with Hunter and Krew. Cookin big vip lunch tomorrow, sat rockin the Metropolitan Cooking Show",
  "Check out Open Sky and get hooked up with a set of Knuckle Sandwich knives!",
  "Headin' down to LA to cook up some pizza for my friend John Lasseter as he gets his star on the Hollywood Walk of Fame.",
  "How would you prepare this recipe?",
  "The same iron chef that made orange crocs cool can even rock the bleach and bling.",
  "All tha Krew kidz are doin' Halloween right in Santa Rosa tonight...",
  "Gettin' Halloween goin' with Ryder's kindergarden class...dig it!",
  "Don't forget to check out my foreword in Nadia G's Bitchin' Kitchen cook book...get your copy here",
  "Shootin a kewl joint called Glass Onion and on tha juke box,is one of my favorite artists, Eric Lindell...Check em out",
  "My brutha Tommy Grella from Next Food Network Star Season 3 is finally opening his own rstrnt ths week...check it out!",
  "Motley Que Crew rockin the Jack Daniels Invitational.",
  "One of my fav fried chicken joints. Prince's in Nashville",
  "Killer time in Lynchburg with tha Motley Que boys...congrats on a great performance.",
  "Hunter and I are checkin' out some great joints in Santa Barbara today...great beach eats",
  "In Santa Barbara shootin Triple D. Such a cool area. U will dig the locations!",
  "Gettin new ink from Joe Leonard at Monkey wrench Tattoo. Dude's the bomb and did the illustrations in my cook book.",
  "Steve Harwell from Smash Mouth. Eating 24 eggs for St Jude's. Raised $15k out front of Johnny Garlic's Dublin!",
  "At Scandia mini golf with Ryder and Hunter. Ryder made a hole in one 3 times, last one on the 18th. Rockin it at age 5!",
  "Enjoyin'  a weekend at home with Hunter and Ryder...",
  "Rainin' in Nor Cal....diggin' the new top from Classic Industries to keep the DDD Camaro dry!",
  "It's official...just launched Guy's Burger Joint on Carnival Cruise Lines!",
  "\"Guy's garage\" closing party is rockin. Tons of killer meats from Golden Meats and Gia Russa with the salsas. It's on! Gn.",
  "Hey u guys. Gettin ready to tear it up at my closing party for the NYC food and wine fest. Hope u r ready to rock. Guy.",
  "In the country. We formed the team 8 years ago. They won using my bbq sauce. Wow!  Congrats to Mikey Z, mustard, Unyawn and Riley!",
  "Motley Que wins the 2011 American Royal BBQ competition open. They are Grand champions in one of the biggest bbq",
  "Announcement: Dublin, California. Grand opening party at new Johnny Garlics on October 10th. Tickets available at...",
  "Announcement: Dublin, California opening new Johnny Garlics on October 10th. Tickets available at the restaurant...",
  "Just had one of the best Italian dinners in NYC. San Pietro on 54th. This is the chef Antonio and owner Geraldo.",
  "Wrappin' up some more ep's of Big Bite in the wine country...ur gonna dig 'em!",
  "Cookin' up some trouble with my brutha Sammy Hagar...can't wait to tell ya",
  "Check it out!",
  "Gearin' up tha house for some new episodes of Guy's Big Bite...you're gonna dig 'em",
  "Checked out an amazing vineyard today, Williams Selyem, and met winemaker Bob Cabral...da man",
  "Headin' up to tha lake with tha Lori, Hunter & Ryder!",
  "Just cruised by North end cafe in Manhattan beach. Awesome joint. Kewl dudes. And the egg rolls rock",
  "Gelsons supermarket in LA rollin the GF BBQ sauce. Nice!",
  "Headin' home then off to Mexico for some fishin' and a little Cabo Wabo",
  "Last day in Vancouver for DDD...wait till u c this place!",
  "Vancouver is off tha hook...what a beautiful city...",
  "DDD fans in Vancouver!",
  "Headin' north to Vancouver for the first international DDD!",
  "Big tasting today at tha house for some new meat products to hit stores soon. Costco is blowin' up with tha tri tip!",
  "Gettin' close at Johnny Garlic's Dublin...almost ready to rock tha kitchen!",
  "Packed up tha trux and heading up to Ferndale,where I grew up, to check out the Humboldt County Fair.",
  "Back in NorCal...its good to be home! Wow lollapoolza was rockin' Cage the Elephant was so the bomb dot com",
  "All good brutha!In nyc takin Hunter and Krew 2 Mets game. Whens yer RI marathon?",
  "Wrappin' up the celebrity showdown today...ur not gonna believe who won!  Such killer competitors!",
  "At sammy hagars beach bar in AC with da krew!  When yer here ya gotta check it out!",
  "Cheesesteak Battle was off da hook!  Gettin' ready to hit White House Sub Shop with da crew,when ur here u gotta check it out!",
  "Takin' Lori to Rao's tonight...doesn't get much better & we're hangin' with the wild man Bo Dietl!",
  "Gonna be an off da hook weekend in AC!  Guy",
  "Diggin' NYC and tha new show...can't wait for you to see it!",
  "Killer day for grillin'...have you tried my Santa Maria Tri Tip from Costco?",
  "Big tasting at Johnny Garlics Santa Rosa...rockin' some new recipes!",
  "Check out Extreme Chef on Food Network tonight from my MTWI buddies!",
  "Testin' some new marinated meat recipes for Costco today...got any ideas?",
  "Check out a brand new episode of MTWI tonight! 8/7 Central on NBC",
  "Lookin for support with Share our Strength and No Kid Hungry. Plz take the pledge today",
  "Happy Birthday to my mom, Penny.",
  "On set at Phineas and Ferb!",
  "Get cookin' with ur kids for Father's Day!",
  "So its official, the Guy Fieri Food Road Show is wrapped!  We cooked-n- rocked it across the USA!",
  "Hook ur dad up for Father's Day with Guy Fieri Food!",
  "Tha Road Show's at Hard Rock in Catoosa, Oklahoma tonight!",
  "The Road Show is comin 2 Hammond, Indiana Saturday night at the Horseshoe Casino!",
  "Cleveland Rocks!  The Road Show Sunday night 5/22 at the Palace Theater!",
  "that's comin from the best food and wine radio co host a Guy cud ask for!  Thanks Marcy!",
  "Come hit the Road Show in Windsor, Ontario on Saturday!",
  "Takin' Gorilla, Stretch, Panini, Woody up to Canadatha Road Show goes international! Should be interesting.",
  "We're rockin' to  Cherokee, NC for the Guy Fieri Food Road Show on Thursday...see you there!",
  "Kickin’ off the Guy Fieri Food Road Show in Charleston tomorrowget ur tix!",
  "So I'm in the winner's circle and jockey throws me a rose from the garland and says \"hey chef\"yeah!",
  "At the Derby, standin at the paddock, gettin ready for the big race. Amazing!!",
  "In nyc just a few hours and had to hit \"tasty hand pulled noodle\" they r so on point!",
  "In Vegas to get Alum of year award at UNLV. Mirage hooked up a Villa and these kewl sheets!",
  "Cookin krew breakfast. that's (l to r) dirty p, glen, and dustin",
  "Campin’ with the fam and the Krew for Easter weekendgood times",
  "The krew from Vidmar ( is comin’ out to Nor Cal to rock out my garageanybody ever put in a Vidmar garage?",
  "Home to Norcal",
  "Big weekend comin up! Easter for the boys and for the GuidStanley Vidmar is gonna rock out my garage!  Pix next week!",
  "Gonna hang with the VFA-37 Ragin’ Bulls pilots in Norfolk, VA tonightsic!",
  "Had a great interview on triple D with Hall Of Fame coach Lefty Driesell and his wife Joyce. Really kewl!",
  "In Virginia Beach shootin Triple D. They love the Rock Fish down here. This bad boy is 25lb +",
  "The Guy Fieri Food road show is gearin up with my bros from triple d, Stretch from Grinders, Panini Pete, and Gorilla.",
  "Norfolk, Virginia for DDD this weekgonna hit some rockin’ joints!",
  "By the way in the pic was L to R. David \"big bunny\" Canada from DDD, me, Chico from DDD and Panini Pete. .",
  "Rollin outta Bama, \"supper on the sand\" was a great event. Off to Norfolk for triple d.",
  "In Gulf Shores Alabama, at a great event\"supper on the sand\" to promote the great gulf seafood. 500 ppl wow!",
  "The tour is gonna rockwe’ve got DJ Cobra & Wild Woody the mixologist from Australia…hope u make it",
  "Hangin’ with Panini Pete today in Gulf Shores, Alabama to raise some dough for the Gulf’s recovery",
  "The crunch burger was on point!",
  "Only one more month till we load up da tour bus for the Guy Fieri Food Road Show, powered by the National Pork Board",
  "Just landed in Newark NJ, rolled the red eye from cali. Flight got a little freaky with turbulence. Kewl gig tonight",
  "My new cookbook Guy Fieri Food is comin’ atcha with big bold flavors—check out this behind the scenes shot",
  "Rollin outta vegas back to nor cal",
  "Super agent hodes,of wme, and I are off on another adventure....sic G2 huh?",
  "If u guessed dinner was for coach John Madden, u were right. Happy 75th! (Check out his chef Sandwich",
  "The krew and I are cookin a surprise bday dinner for a hall of famer. Can't tell ya who until he gets here. Any gu",
  "Diggin’ bein’ back home with da fam.",
  "With tha Krew workin’ on the Roadshow dishescan’t wait to get on da bus!",
  "Crazy tough games on Minute To Win It tonight at 8/7c...check it out:",
  "Check out the wild artwork in Guy Fieri Food from my brutha and tattoo artist, Joe Leonard",
  "Check out the rockin' cover to my new cookbook  GUY FIERI FOOD comin' out May 3!",
  "Makin’ some RITZ recipes with tha Krew today for judgingthe RITZ fans are nailin’ it…",
  "My new monster pepper grinder for the Guy Fieri Food Road Show. Usin it on set for Big Bite today, crazy!",
  "On the set of Guys big bite in LA. Hunter and my nephew Jules were on today, they rocked the show!",
  "Back to So Cal for more GBB with dad, Hunter and Jules!",
  "Bitchin' Camaro...thanks to my bruthas at Chevy! First yellow conv off tha line!",
  "Shootin’ new episodes of Guy’s Big Bite this week in LAyer gonna dig these new recipes",
  "\"Check out the Nadster from Bitchin Kitchen and vote for her here",
  "Killer app's?  Check out my RITZ Cheese Steak Sliders!",
  "Great night at my brotha Sammy's spot, Cabo Wabo at Harvey's in South Tahoe!",
  "The Guy Fieri Food Roadshow is officially powered by Pork thanks to the National Pork Board!",
  "5 feet of fresh pow for some killer boardin' with Hunter!",
  "A rockin' 30 hours in NYC shootin'...off da plane and straight to Tahoe with da fam",
  "Chuy used to work for me at Johnny Garlic's and is now killin' it in Chi Town with his joint, Chilam Balam.",
  "At the big int'l home n housewares show in chicago. Hangin out with the krews from Outset and Ergo chef. Kewl show. G",
  "Check it out back to back episodes of Minute to Win it tonight. Yer gonna dig jason christy. G",
  "In tampa bay area shootin some great triple d joints. Hittin Chicago next tuesday. G",
  "In south beach hangin with one of the greatest. KC. Wow. What a kewl dude!",
  "In the everglades outside of miami with the krew.  Gettin ready to rock with the airboat assoc of florida dudes. G",
  "Diggin' the love for my buddy Michael Symon...James Beard semi finalist for Outstanding Chef...",
  "Tonight is gonna be a wild one on Minute to win it. This father and son team are great! Hope u dig it. Guy",
  "Oh yeah brutha!!!  We shall rock. Miss ya man. U good?",
  "Ya gotta check out minute to win it tonight, really cool players with a great story. G",
  "It's crazy...Rev. Jackson at the Super Bowl",
  "The Super Bowl is off da hook...Hunter and I on the field",
  "At the super bowl. Whoa! Stadium is huge. Rocked the ritz tailgate today on fox.",
  "Hangin' at tha Super Bowl  with Lori n tha RITZ Krew.",
  "Hunter and I had a great time at Beach Bowl in Dallas...didn't de-bling",
  "Capt Morgan getting ready to throw down at the Direct TV Beach Bowl",
  "Hooked up with Cee Lo at da Super Bowl...great show!\"",
  "Rockin' with Mario, Tim Love and Emeril at their off tha hook charity event, Spaghetti Western",
  "Quick 12 hours in NYC...off to San Antonio for DDD",
  "Chillin' with George Lopez...funny dude!",
  "Hittin' LA for more Minute To Win It",
  "Hada rockin time w Exec Editor Dan\"palomino\"from's a bts look from    Check out the hard copy in Feb issue.",
  "Luigi from Pizzeria Luigi, Hodad from Hodad's Burgers and Gorilla from Gorilla BBQ all in da house cookin' B-Day grub.",
  "On the set of minute to win it. Audience is off da hook. 2011 eps are gonna rock!  G",
  "Tonight at 8pm CST is the Season 2 Premiere of NBC's Minute To Win It on NBC! Check it, it's gonna be a blast!",
  "Can't wait for the the M2WI Holiday Event Finale tonight!",
  "Diggin' burgers tonight on DDD...check out the Guy-a-thon!",
  "Tune in to NBC on Tuesday, December 21 at 8/7c for Minute To Win It's Special All New Holiday Event Episode!",
  "Big shout out to my friends and da fam in Cleveland...tonight on tha Guy-a-thon...",
  "Guy-a-thon on FN this week...back-to-back?  Crazzy!",
  "Shootin’ Triple D in Indy, looking forward to 2-nites M2WI holiday shows.  2nite at 8pm!",
  "Lookin' forward to the M2WI holiday episode... You gotta check out how we jacked up the prize package to 3 million dollars!",
  "The holiday premier of Minute To Win It airs Tuesday December 7th, you gotta check this out, it's gonna be insane!",
  "Da buzz on the pigtail flipper is rockin’gotta get it here:  …proceeds go to fundraiser.",
  "Check out da sweet pigtail flipper made from scraps left from making da “Pork Chop” Guitar!.  Get yers!  http://mdx",
  "Check out saturday night live tonight. There's a parody of me cookin for thanksgiving. G",
  "In Cleveland for Fabulous Food show. Such a kewl show! 3 demos today then off to Puerto Rico",
  "Kelly Hanson, from Foreigner, rocked the national anthem",
  "At Texas motor speedway, sittin in Kurt Busch's pit box watchin the race. Whoa! off da hook big time",
  "Rollin with Steve Post on Tradin’ Paint Sirius Radio in Texas Motor Speedway!",
  "Rollin with Steve Post on Tradin’ Paint Sirius Radio in Texas Motor Speedway!",
  "At the first game of the World Series with hunter and lori. The place is rockin!!",
  "Check out my buddy Ming Tsai's new book tis off da hook. ?Check him out at?",
  "Just hit LA, doin a cameo on the Price is stopin at Globe shoe HQ to work on design for Knuckle sandwich shoes",
  "Giants win( sorry sent too fast). GIANTS win!!!!  Yeah!! Go nor cal!!!!",
  "GIANt",
  "Check out the new kings of leon album, it's off da hook! The dudes rock!  G",
  "Had a killer time at nyc food and wine fest. Closing party at city winery was off da hook! Rollin to sammys b day!",
  "At tasty hand pulled noodle in china town in nyc. The Krew is diggin it!",
  "The show with kelly was so money!  The entire team there is on point and make it top notch. Really appreciate the opportunity!  G",
  "Gettin ready to co host Live with Regis and Kelly. Gonna be off da hook!  G",
  "At sage in nyc shootin triple D, they use the same killer pizza oven, that I have in my back yard, its a mugnaini",
  "At Ben's best in Queens, just interviewed Congressman Ackerman.  And introduced the new sandwich, the Triple D",
  "Does anyone use facebook? Join us",
  "Hada rockin time last nite at da house of blues, jamey johnson was tearin it up!  Last day of filmin GBB in LA today.",
  "Hey Batali  ...Walkin' quietly....and bringin' some big flavor!",
  "My new \"pork chop\" guitar custom made from the kewl catz at MDX. Sittin proudly on the stage of Guys Big Bite!!!",
  "Dude is the real deal, no fools gold! Lol!",
  "On the set of Guys Big Bite, shows have been rockin. Hada bro on the show yesterday, great actor that digs cookin and surfin. Any ideas??",
  "6am flight to for Guy's Big Bite. Season finale of M2WI 2night, military salute. Such a memorable show, you'll dig it.",
  "2night season finale M2WI.one of my favs….military stories that will have you tears…check it out",
  "Da Superdome is a rockin’  Rapped with bro Hutchinson from the Vikingsthis feels like the Super Bowl!",
  "Shooting TGW with da crew in  Town’s so pumped for da game!",
  "landed in New Orleans to shoot shows.  DDD and TGW.  Gotta dig the people and the vibe here.",
  "Back and off to New Orleans 2night.",
  "At da lake with the fam.  No shoes, no shirt, no cell phone",
  "What a killer day at Worth our Weight in Santa Rosa shooting DDD.headin home to enjoy M2WI with the fam.    Get a peek!",
  "On da field for the battle of the bay, raiders vs niners. Just shot tailgate warriors, gonna be a great show! Airs",
  "Michael,chef at waddels in Spokane carved this huge ice sculpture for the 3 d shoot. So cool (literally)",
  "Globe shoes, my favs, are makin’ the exclusive knuckle sandwich shoes.  Send’n pics when I get em.",
  "M2WI three nights in a rowkinda like a different pizza three nights in a row….never enough!",
  "The M2WI last night rocked and it was a blast to shoot.",
  "Gotta check out M2WI Miss Universe episode 2night.these girls rocked!",
  "Check out my new blog  . . .central control for Guy news.",
  "On the field for the seahawks/ packer game. Just had a great shoot for tailgate warriors here in seattle. G",
  "In Seattle for Tailgate Warriors shootit’s the battle on the grid iron and the blacktop.",
  "Finally, the duck gets a real 'do!",
  "Me and my new feathered friend. The dude rocks!",
  "That wasn’t the lucky horseshoe - that was ALL SKILL! A quarter of a MILLION dollars worth!",
  "Part of a balanced breakfast and worth ONE HUNDRED TWENTY FIVE THOUSAND DOLLARS!",
  "These guys must have met in a previous life – how else can you explain that teamwork?!",
  "This game is a nail-biter, right? Will Chelsea and Nathan take home $10,000 for this one?!",
  "Just introduced one of da cool bands from the 80's the FIXX. All 5 original band members. Dudes rock it!",
  "Hung with Sir Charles this wknd in Tahoe.  M2WI challenges were hilarious!",
  "What a tripwatched M2WI East Coast broadcast…while on the set of M2WI in, you gotta see 2nights show!”",
  "Newport Beach with fam after All-Star gamemet the coolest dudes…crazy beach life!",
  "Fielding a grounder at the All-Star Celebrity Softball Game this Sunday",
  "I'm at knotts berry farm with the fam, at the gun fight show, and on of the actors yells \"c'mon sarge, u gotta minute 2 win it\". Hahaha",
  "In so cal, playin in the celeb all star softball game. On the bus with some cool dudes, ricky henderson, mc hammer, bo jackson..",
  "Hey Edward, if you win the mil you’re going to name your first kid after me, right?",
  "It’s the premiere of the Million Dollar Mission! Who will be the 1st to take a million bucks out of the 60 Sec Circle?",
  "How do I tell these O’Donohue twins apart? It’s like having double vision!",
  "Will Jessie the risk taker Roll With It to $1,000 bucks?",
  "Rolled into NYC this am. Rocked Today Show and now talkin' M2WI 2 America summer premiere2night",
  "Funny stuff from fan.",
  "Great dudes from the military at Infinion this Fathers day.  Hung with the 26 team part of the day.",
  "Minute to Win It Superfans are so money! To say “thnx” we're offering you VIP tix, shwag, and rockstar treatment:",
  "Dirty (L) and Dustin (r) at nascar in sonoma, such a killa time, down in da pits",
  "my culinary asst's daughter, Dixie, made this diorama of me as a chef. She scored 110%. How kewl!",
  "In Boston's china town, taking Hunter to his first to a Dim Sum joint. He is blown away",
  "At Costantino's Venda ravioli on Federal Hill in Providence RI. The italian deli is off da hook, so is the dude si",
  "A Midsummer Night's BBQ Dream on Guy's Big Bite at 11 am Main Recipe: Blackberry Jalapeno Glazed Pork Tenderloin",
  "Get your pig on! Swine Dining on Guy's Big Bite coming up  at 3:00pm. Main recipe: Spanish-Style Pork Shoulder Steaks...",
  "Get your pig on! Swine Dining on Guy's Big Bite at 3:00pm. Main recipe: Spanish-Style Pork Shoulder Steaks...",
  "Hunter givin the triple d sign at a diner in Maine, he's a pro! G",
  "Hunter and I are shootin triple d in Maine, eatin lobster every which way!  Rollin to Portland tonight to see Steve Miller Band! G",
  "For Big Texas BBQ action, catch Guy's Big Bite Today at 3pm. Main recipe: Vinegar Brined Baby Back Ribs!",
  "At Fenway with the fam. Had a killer tour and went inside the green monster",
  "Gettin some new ink at monkey wrench tattoo in santa rosa.",
  "Cookin abalone for my cook book that will be out next year. The small1 is legal(7in) the lrg 1 is one of biggest I",
  "June 11th, Harrah's for Rock Tour....South Lake Tahoe, be there!",
  "Want to be on Minute To Win It? Details coming soon for our Nationwide hunt.",
  "Whoa-ho-ho! Did you see that?! Melanie finishes the Matchmaker challenge with just ????  Ssshh, it is a secret for those on the west coast",
  "All you couples out there! Check out M2WI Wedding episode to see what this couple can achieve on stage!",
  "At the monterey aquarium with fam, boyz r havin a blast feedin the huge sea turtles",
  "Shot 6 great episodes of M2WI this week, just flew up to monterey with fam to speak at the sustainable seafood event, wow such a cool place",
  "This is seriously | off da hook |",
  "Havin a great triple d shoot with Steve Hutchinson,minn Vikings, and his wife Landyn in Duluth",
  "Off to minnesota to shoot triple d.  Gonna be a kewl shoot since most of  triple d crew is based outta there. G",
  "Just landed myrtle beach SC for the big food and wine fest. Flew in from charlotte with next food network star, Aaron McCargo Jr.",
  "If yer in the LA area tune into Mark and Brian on make surprise appearance and have mike from hodads cookin burgers!",
  "Rollin to LA for Tonight Show. My bud Rob, Myers Restaurant Supply, is cruisin' shot gun.",
  "Alec \"The Ace\" - 1st man to get engaged on M2WI is also LAST MAN STANDING. Level 10, here ya go.",
  "Cowboy VS Ace - the most insane Head to Head ever! 9 glasses, 2 buckets of balls, and a million up for grabs! I (cont)",
  "How bout THAT First marriage proposal in 60 Sec Circle!Unplanned, unscripted, un-blakin-believable!!! Yours truly:Game show/chef/matchmaker.",
  "Try Applstack at home. Tip: Use LARGE red delicious apples.",
  "Wow! What happens next?",
  "Sure Cowboy Rick is the top sharpshooter, but check out Dianna's wild rubber band moves! Looks like an archer.",
  "Michele was a great sport. Played princess at Disneyland. Sorry, no fairytale ending tonight.",
  "Just realized Katherine is the only one throwing underhand. Could slow her down.",
  "Sticky Situation -- Great Game disguised as the world's worst cooking show.",
  "Kerry finishes HPanky second, showin youngster how 2 do it. Check out the little victory dance that earned her the nickname Chicken Lady.",
  "Hank Panky -- 1st game ever played on M2WI. But like this! U wouldn't believe the energy on that stage.",
  "Less than 15 minutes til M2WI. Stay tuned for show tweets.",
  "Check  2night’s M2WI Last Man Standing episode.  Whoa!!! What a great way to cap off Mother’s Day – with the mother of all M2WI challenges!!",
  "Up to the \"Minute\" tweets tonight during the show. Stay Tuned!",
  "My grandma loved this mag!, she’s not with us but it feels good I made the cover.  Check it",
  "Ever wondered how Guy Fieri became Minute To Win It host? Here is a vid for you.",
  "Within the next few minutes, Exclusive Video behind the scenes of Minute To Win It.  Twitter fans get it first! Juicy RT material",
  "My rides made MotorTrend’s Top 10 see cool dude 2002",
  "Senator George LeMieux and I cruisin the 67 in DC. We have had a great shoot here! G",
  "Shootin 30 min outta downtown DC. The krew (L to R) Meltdown, Butterbean, and Chico. U r gonna love the DC joints",
  "Me and all the DDD peeps in da Mesa, AZ area. We did awesome event b4 my Mesa roadshow in Dec. So kewl to have eve",
  "2nd shoot day in DC,with a little rain to cool it down! had great dinner at Central last night, oysters were the bomb! G",
  "Look who is going to play Minute To Win It.  Jonas Brothers go for broke.",
  "The buzz is buildingJonas Junk in the Trunk on M2WI…wassupwitdat!",
  "Derby was great.  Just landed in DC to shoot some Triple D. Got some special guests stoppin by, gonna be a great shoot.  G",
  "My new baby..see her here   - That's the way I roll",
  "Derby, so far... Haven't won a race, but gotta dig hangin with Salt-n-Pepa",
  "Take a peek at who is going to play M2WI",
  "Wow, whatta day. Light rain, muddy track and a buncha good times. 136th Kentucky Derby",
  "Just introduced Travis Tritt at the Barnstable Brown gala. Whoa!!! Whatta a kewl cat",
  "In Louisville for derby, just introduced 3 Doors Down at outdoor concert. They're rockin it big time. So money!",
  "Good Day last Monday....M2WI rocks da house!",
  "Lori, krew, and I rollin to the Kentucky Derby, gonna be off da hoof!!",
  "Where do you shop?",
  "Just had a great shoot with the crew from \"best thing I ever ate\" wait till ya see some of my places... Yer gonna dig'em",
  "Kewl shot of the Oak Ridge Boys who stopped in during Nashville DDD !",
  "Cookin dinner with the cool cats \"Kings of Leon\" at food network kitchens. Great dudes, 8 of my fav dishes! off",
  "In philly at WMMR Preston and Steve show, dudes are sooo off da hook, just doin a fly by to say hi",
  "Just landed in philly, gotta dig this town, doin a triple d voice over, then off to QVC for a meeting. In NYC tonight",
  "At disney with da fam. Havin a blast. Just rode california screamin 2 x in back, so money!  Off to philly tonight",
  "Just got done w/shoot n KC. Some killer bbq joints, such kewl to meet fam at disneyland and demo at food and wine fest.",
  "Big bunny, chico, and melt down, Chico and bunny were the original DP and audio on the begining of 3D. Great cre",
  "In the studio at maverick media doin some commercials for the Jack Levar memorial golf tourney, at oakmont golf course, fri May 7th",
  "In nashville shootin triple d, just interviewed the Oakridge Boys and Rickey Skaggs at one of da locations. Cool dudes!",
  "Oooohhhh.. Yeah! America is getting hooked on M2WI!? Check out the home videos here.  Keep'em comin",
  "This is the egg hunter and ryder made for me.... Funny stuff. Hope u all have a great easter. G",
  "At heavenly in south shore tahoe... Great snow, cold wind. Hunter is doin great!",
  "Check out my new grill planks at  Bed Bath & Beyond. Made by the dudes from outset, they're also makin my grill accessories, great stuff",
  "On the set of GBB at the culver studios. They rolled the entire set in from nyc. Kewl!",
  "shootin guys big bite(2shows) then back up to nor cal to see was wild,3 shows in 10 an eye out 4the\"rojo onion rings\"",
  "In la shootin guys big bite. Great team and locaton. Shootin 3 shows a day till next wed. Lots a killer new recipes, ur gonna dig em. G",
  "Flew down to la, doin a voice over for triple d, a walk thru on guys big bite set(shootin in la now), and bonnie hunt show too, busy day!",
  "Just flew into nyc, had a great interview on msnbc morning joe show, now at regis and kelly to promote M2WI",
  "Killer stone statue of TEX WASABI was made in china, weighs 3800 lbs and was a gift from Chino Bandito in Phoeni",
  "In sac town with tom,my mgr, visitin NBC station to talk about M2WI. Been catchin some of the rough cuts, I think u r  gonna so dig this. G",
  "At johnny garlics in santa rosa doing a satelite media tour for Minute to Win It show. U shud see the huge tv truck in the parking lot.",
  "At my, luna en fuego party at gansevort hotel to wrap up the south beach food and wine fest. Such a killer party ..sold out, 1400 ppl. Yea!!",
  "Havin an off da hook time in south beach for the food and wine fest. Gettin ready to cook for the kids at kelloggs kids kitchen. G",
  "At mac's club duece in south beach miami, wow, u gotta have a cold one here. This is a triple D widout",
  "In south beach miami, this is the pic of the stairwell from da movie scarface. This town is packed for SOBE",
  "Hey the Minute to Win It team is gonna be shooting fans playing the games at Universal City Walk tomorrow at 10:30am near the Globe. G",
  "Shootin show opens for triple d down on the water in jacksonville,then flyin out to miami for food n wine fest. Great event u shud check it!",
  "Shootin triple d in florida on the SEA KING 95 ft shrimpin boat.... Fresh shrimp gotta dig'em.",
  "At an asian supermarket in vancouver's china town. Gotta dig finding live abalone for a pound. G",
  "3700 ft on top of grouse mountain for Today Show. Matt and crew from NBC... so on point. Takin tram in the dark",
  "In Vancouver 4 the Today Show to talk about Minute to Win It. 2 hour debut March 14th is gonna be off da hook. G",
  "On my way up to the Olympics for the today show (on tomorrow), talkin about minute to win it debut 3/14,and seein some events..",
  "Shootin triple d in so cal this really kewl joints. Rainin today,and that always makes the show intros interesting w/a convertible",
  "Here we go superbowl, kick off time, sittin in sky box with hall of fame Jim Brown. Whoaaaa!",
  "Gonna be cookin on the CBS pre game show, rite around 245p et. Weather is killer, huge crowds outside, gonna be",
  "Cookin at superbowl pre game show tomorrow. Rehersal was great today Boomer, JB, Marino,Shannon, and coach r rea",
  "At sonnys in hollywood florida, crazy cheese steaks, ya gotta check it out! Cbs show tomorrow am,gonna be kewl!",
  "At sonnys in hollywood florida, crazy cheese steaks, ya gotta check it out! Cbs show tomorrow am,gonna be kewl!",
  "Just hit ft lauderdale, gonna try cruisin by a few triple d joints while in town, sonnys, bennys, havin some breakfast at grampas now!",
  "Gettin ready to roll out to the super bowl in miami.  Gonna co-host an nfl party on sat pm with michael strahan. Ill keep ya updated. G",
  "On the set of \"Minute to win it\" right now, between games. The audience is so great. Show debuts March 14th 8pm.",
  "Just ate at one of my fav joints in LA, Mambos, the bomb cuban food. featured on triple d last year. Off to shoot",
  "did first segment of the show.... The place is rockin! G",
  "1 min from walkin on stage to shoot the first episode of Minute To Win It. The 350 ppl crowd is goin nutz!  G",
  "today is the day,off to shoot the 1st of 8 episode of NBC's MINUTE TO WIN IT in LA. Stage is amazinga,crew is on point, its gonna be great",
  "In reno shootin triple d. Some kewl joints u gotta try in the area.  Outta here tonight and off to sonoma county for 2 more places. Guy",
  "One of my favorite bands, Cowboy Mouth is rockin tonight in san fran at slims .sat they're in LA at house of blues. Checkem out. So money",
  "So money! On the set of Minute To Win It. U r gonna dig this, its like\"thunderdome\" start shootin jan 15th",
  "Just rolled into minute to win it show team, then goin on from hodads in san diego rollin with me. Gonna be a good day",
  "Hope evryones havin great holidays. Hunter and I are at 8500k ft boardin at heavenly in tahoe.",
  "This was a gift from the owners of chino bandito is arizona. Took a year and half to be carved in china. At TW In",
  "In roseville at johnny garlics signin books. Then at tex wasabi's in sacramento at noon to sign some more. Hope u all have great holidays",
  "Just wrapped the tour in vegas. at the airport rollin home. Thanks to everyone that helped make the tour off da hook. See ya in da fall. G",
  "The last major moment in GFRS tour. Hittin final nite, 21st show in vegas at house of blues",
  "Check out this kewl piece that just came out in playboy. Shot in nyc.",
  "Tour is rockin, hittin mesa az tonite, vegas tomorrow. Hunter just flew in, he'll be rockin the stage tonight. So kewl!!",
  "Knockin out some kewl shows in san fran. Did, KGO, Lammont and Tonelli at the BONE, and then Don blue at star. Off to san jose for road show",
  "At pizzlachik in boise. young guy throwin the pie is montana, he's 13, and wow the pie is killer. Shot triple d h",
  "In portland, what a day. Book signing at costco, shootin the road show special for food network, and gettin ready to hit stage show 16.",
  "Just tore it up big time at KISW the rock of seattle. Shot the begining of the 1 hour documentary of the Guy fieri road show.",
  "Just rolled into seattle for show tomorrow nite. So dig this town, great people and food. Niko and sikey from voola's cafe open show tom ...",
  "Wow!, huge thank you to everyone that bought the \"MORE diners drive ins and dives\" book. It just hit #1 on NY times best seller. Off da hook",
  "Big snow storm hittin iowa right now. Shud make the ride outta here, to KC very interesting. Road show #12 tonite",
  "At horseshoe casino in indiana, wild crowd, can hear'em all the way in the green room. Goin on in 5 min. This is #11 show. Yeah",
  "In detroit. Gettin ready to rock it for 2000. The pic is dirty,kleet, mgr tom, stretch, dj cobra",
  "In Atlanta for the road show. Wow 7th show already..... crazy. Chef Robert Irvine from dinner impossible is guest",
  "With da krew at loveless cafe. Good stuff, really nice people",
  "Wow, rocked raliegh nc last nite; crazy 11 hr ride to Nashville. 6th show tonight, panini pete will be in da house",
  "Sooo kewl,\" knuckle sandwich presents\". This is a tix to the road show in Wallingford. Gonna rock tonight! Guy",
  "Gettin ready to rock the house in philly. Chef tony luke just finished, woody on stage now, and in 40 min we launch show two. YEAH!",
  "In boston, kickin off tour tonight. On this crazy morning show on WAAF. U shud see the culinary cook off. So funn",
  "In lowell Mass, when u see this bus, u will know the tour is in town. Guy fieri roadshow is gonna rock",
  "Ooohh yeah!  Just hit boston. Gettin ready to launch the guy fieri road show tour.  Starts tues in Lowell Mass. Gonna be nutz!",
  "Here in my hometown, on froggy with great friends, rob and joss, they were huge in helping with food network",
  "Just landed week, over 72 interviews for the Guy Fieri road show and new tripleD job by entire team to make this happen",
  "If u r at the metro food  show in DC. Check out the boyz at ergo chef, they have my roclin knives on display for order.",
  "Just gettin into DC, ready to tear it up at the Metropolitan Cooking and entertaining show.  Kewl show, check it out",
  "The venue in philly where we r gonna rock out with the Guy Fieri Road show! Built in 1819. YEAH!!",
  "In philly at NBC 10, talkin road show at Kimmel center. hangin with Wyclef in da green room, kewl dude!",
  "Soooo killer! At game six of the world series in nyc. Big man Jared from star power hooked it up This place is go",
  "At the VIEW, talkin about book and tour, its gonna air on friday. So kewl!",
  "At pix 11 in nyc with these 2 crazy hosts (tansen and sukanya). Crazy show talkin about book out today and road s",
  "Was on a radio media tour all day about triple d book comin out tomorrow and the Road show. At sirius radio, and",
  "Just hit nyc,big day tomorrow, Today show, and Letterman to kick off the \"MORE diners drive ins and dives\" book 2. Here all week talkin book",
  "Hey there, \"Guy Fieri Road Show\" is gainin speed and is gonna be rollin into a city near u soon! Crazy mixologist",
  "My 1st  triple d book made it to #2 on nytimes best seller, new book out this tues nov 3. Let's hit #1. If ya want signed copy-",
  "Shootin a joint called DISH,in charlotte, rite down the street from one of our favorite triple d locations, the P",
  "In charlotte NC shootin at south 21 drive in. Place has been here since 1955, home of the super boy. Here's a pic",
  "At casa workin on recipes for guys big bite and for MY cook book which shud be out in 2010. Hope yer havin a good",
  "At united fishing agency in honolulu, the only fish auction in the united states. They auction off over 50 thousa",
  "Great shoots in a top secret package from spike, r set desinger,on the materials for the sick orange fur for dj booth",
  "One of my bros, manny hinojosa, badass mixologist for've rolled france, nyc, sf, sr, wild to run into",
  "With the \"A\" krew of triple d shootin in hawaii, from left to right, bunny, kare bear, boy band, and beaver. Shoo",
  "Back stage in honolulu at aerosmith with hunter,Mgr tom, and buddy christian. This is a pic of me hunter and knif",
  "On my way to pearl harbor navy base to cook with a group of culinary specialists. So stoked to have another chance to work with our soldiers",
  "Just went snorklin with lori and hunter in hanauma bay by waikiki. So killer, except I swallowed a gallon of salt water... Saw a huge eel",
  "Just gotin 2 hawaii,time here with lori and hunter for 3 days,then shootin 3 D for anutha 4. Sat I cook for military with hunter and kleetus",
  "Hunter knocked out som rockin chix parm last of op Brett&Exec chef Davin from my restaurants were over,they said he nailed it. Yeah!",
  "Killer noodle shop in nyc \"tasty hand pulled noodle \" on doyer and bowery. Here with kleetus, brunch, and my  ...",
  "1st twit pic ,New book out nov 3, front cover shot in my home town. Wait till ya read some of the stories fro ...",
  "Great opening party at nyfwf. The crowd was jammin to the band and havin a blast. Gonna be a wild weekend. G",
  "just got first copy of my new \"more diners drive ins and dives\" looks so off da by emeril. Yer gonna dig it, out nov 3",
  "Just got to nyc for the nyfood and wine fest. Its gonna be a wild weekend. Tomorrow nite I'm havin a kick off party at chelsea mrkt, yea!",
  "In fairbanks alaska gettin ready to shoot triple d. U wudnt belive it,its 830 am and the sun is just barely comin up. In dec 4hrs lite a day",
  "Cooked with kleetus and crew last nite, rocked a garlic  porksausage ravioli done in a red bell pepper vinegar sauce. Sooo killa!",
  "At hunters soccer game,then Flyin to alaska tonight(rollin from 85 degrees to 30), shootin there for 3 days then off to nyc for nyfwf",
  "Got back to cali this am from nyc. Havin big time meetin rite now about the Guy Fieri Road Show. It is buildin so much energy.",
  "Sorry, I did a rookie twitt, I was tryin to respond to my homie Jesse James,about a pic of a sick viper hot rod he sent me. Ya gotta see it.",
  "Siiiiiicccckkkk!  What r da specs?  G",
  "In nyc shootin ulitmate recipe showdown. Last day,it airs in march. Huge event with NASCAR,tommy baldwin racing, and NY times last nite.",
  "Took red eye flite to nyc from sfo this am, to shoot anutha 3 episodes of ultimate recipe showdown. Off to alaska to shoot triple d on sat",
  "In nyc shootin ultimate recipe showdown. Great competition so far. Studio audience is doin a rockstar job!... Show airs in jan, check it out",
  "Just flew Into knoxville Tenn. To do a united way fundraiser tomorrow. Had a blast at turning stone, show at club lava, was soo off da hook!",
  "At turningstone casino in upstate ny, did rockin food show for 5000ppl, WOW!  Wild audience. BigShout out to twomey/wilkinsky wedding party!",
  "Wanna come see me film Ultimate Recipe Showdown next 2 weeks in NYC? go to  info and tix",
  "Tomorrow presale tix for the GUY FIERI ROAD SHOW go on sale, password is FLAVORTOWN. Great mixologist from australia, dj banks and me!",
  "Off da hook shoot, triple d at raider game with kenny \"snake\" stabler. Shud air in 2 months",
  "In oakland, shooting DDD at Raiders mon nite game. 3 diff restaurants doin tailgating, gonna be a killer show. Guy road show schedule is out",
  "Up in kelsyvill ca, Goin to Lynard skynard with the krew, brought some killer food from johnny garlics for the band. Gonna be a rockin nite",
  "Goin to meetin with Joe Leonard at monkey wrench tattoo, he does all my work, to talk about tattoo artwork for guy fieri road show t shirts",
  "Fyi, last day to enter the nat'l pork boards \"search for the next pork personality\"I am hostin it in nyc, check it out",
  "The Guy Fieri, Knuckle Sandwich series Knives (made by dudes at Ergo) won an award of excellence at the SF Gourmet Show. So kewl!",
  "In nyc on set of guys big bite, gettin ready to wrap last of 20 shows. Wow, been a run of great recipes. Such a killer crew workin onda show",
  "In nyc shootin GBB. Good buddy Michael Perea from vegas, killer mixologist, is gonna be on 3 shows today. Doin 20 shows. Great shoot crew.",
  "In nyc shootin gbb, off today, havin lunch with anne burrell in china town at my fav potsticker joint nice green bo. U gotta check it out!",
  "Shootin in buffalo ny area. Mayor of Tonawanda gave me the key to the city yesterday. So kewl. One more shoot here then off to nyc for GBB",
  "I totally dig doin triple d, but yesterday it was a great visit from a young boy w/ \"make a wish\". whata kid,such an inspiration",
  "Rocked seneca over by 1hr.. Wow, crazy crowd, 1 of the best crowds ever. We had a blast. The tour will rock",
  "Gettin ready to go on stage for 2300 people at seneca casino in niagara falls, its gonna be off da hook. G",
  "In buffalo ny shootin \"tailgating warriors\" 4 food net. my prod co. Rag top. Gonna be a great shoot. Krew is here TCB",
  "In anheim gettin ready to do 2 demos at hilton. Flew woody in from australia to practice knuckle sandwich road show",
  "In san diego w/ family at seaworld, what a great tour, hunter n ryder have got to touch so many cool birds and mammals.",
  "Had a rockin time in AC, hung with Emeril, duff, ingrid, ted allen, did big dinner at ceasars sat pm, big demo last nite",
  "In atlantic city 4 killer food and wine show, hangin out back stage 4 hall and oats, gotta dig the old skool 80's,  kewl dudes",
  "In nyc shootin a piece for a major magazine that will be out in dec... So off da hook. Just fyi not in kansas city, someone sayin they're me",
  "Check it out, good morning america tomorrow 8 ish to demo summer grillin. Then off to atlantc city 4 food and wine show w/ kleetus and krew",
  "Shootin triple d in narragansett RI, vacationed down here with family 5 yeas ago, nice to come back and feature one of the places. G",
  "Just got to boston, with hunter, to shoot triple D, some great joints here. then hittin GMA on fri am, gotta dig gma.",
  "Tex Wasabi's in Sacramento Exec Chef Henry Ventura has just gone 3 for 3 with the\"brown bag\" chef challenge on local tv show. Rite on henry!",
  "Had a blast yesterday at the tahoe celebrity golf tourney. All kinds celebs, great weather, and we rocked out some killer pork el fuego",
  "Just a heads up if u r in atlantic city area, gonna be there doin  demos at harrahs on aug 1 and 2nd. Some of the krew is flyin in with me.",
  "Had a great triple d shoot in cleveland, momochos, luckys cafe, melt, to name a few. Off to tahoe this weekend to cook at celeb golf tourney",
  "Gettin ready to hit cleveland for triple d'(sun thru wed).  Great town i have a bunch of wild cousins there, shud be a fun week.",
  "Had great weekend with fam up at ruth lake in Nor Cal. Rollin out to LA for meetings about  GF knuckle sandwich road show, its gonna rock!",
  "In Houston, had dinner last nite with one of my favorite NFL players Dan Pastorini from Houston Oilers. Such a great guy and wow the stories",
  "Had a great time on fathers day at nascar race with hunter, ryder, and my dad. In houston shootin triple d till thurs.",
  "At infineon raceway in sonoma, great day, killer weather, rollin with lori and hunter. Gonna see kenny stablers car run today, so kewl!",
  "i just checked out my site, usually just roll with the blackberry, so cool 6496 following. thanks!",
  "Had family portrait out at bodega bay calif today, such a great area. Gettin ready for a big weekend of nascar at infineon track. G",
  "Thanks to all the kulinary rockers that were at shoreline tonite. We had a blast, the Knuckle sandwich tour rocks 22 cities startin in",
  "Wow 3 tweet 1 day, forgot to tell ya check out kleetus blog on my web site. , good stuff!",
  "Bobby, anne burell rollin into town for great american food fest at shoreline, gonna be such a blast,  krew is rollin with me, shud get wild",
  "shootin nor cal triple D joints this week. Doin front cover photo for triple D book II. Great american food festivle sat, demoin' 2 times.",
  "Just hit vegas with lori for good friends 45th bday. Went to school here, and man it seems to change everytime I come back. Go runnin rebels",
  "In LA shootin triple D, just did a drink challenge with mario lopez on extra, while I was at one of the diners.  funny stuff!",
  "Shootin triple d in la, just did a great tamale place, now at a slow fast food joint that makes their own pastrami, u guys r gonna gig it. G",
  "Gettin ready to go on stage at disney for the food and wine fest. event gets better each year. Hunter and ryder all over rides",
  "In la, with fam, shootin a polish place in eagle rock area, then headin to disney. Ryder is soooo excited to see mickey and donald, so kewl!",
  "home in santa rosa, doin voice overs for triple d, meetings with  management team, a few interviews, disney tomorrow,yea",
  "In hollister calif, ridin dirt bikes with family. Weather is great, hunter is tearin it up on a 2 stroke 80, and I'm rollin a 450 KTM",
  "Had a great day at calif state capitol with first lady and alice waters. We celebrated the planting of the 1st veg garden on capitol grounds",
  "In oklahoma city, shootin diners, wow, kewl joints, ya gotta check out nics grill in an area they call \"ten pen\". G",
  "Just did a killer shoot for food net mag, made sausage, casing and all, shot at seghesio winery, will come out in oct issue. G",
  "Went down to Viking's new show room in Hayward ca. to do a cooking demo. It was cool, Samy choy, Tyler Florence and I all had a good time.",
  "Got interviewd by dennis miller,on westwood 1 show. such a kewl dude, he said he's a fan of DDD, rite on!",
  "Great event yesterday, did a satelite media tour for the national pork board. Kickin off their annual tour. Did 33 diff stations around USA",
  "So check this out, some cat is playin me in KC. Crazy, just for da record, I am home and was not in KC. Thanks to those keepin an eye out.",
  "At the derby, so kewl, everyone in hats and suits, wow! Off to whiskey a go-go in hollywood for fantasy rock camp finale tomorrow",
  "Hey there, just shot DDD in Milwaukee, now down in Chicago at a Peruvian place, U all are gonna dig this round of funky joints. G",
  "just wrapped up 3 days of shootin pro start event in sd, wow, amazing culinary by high school students. Off to milwaukee to shoot triple D.",
  "In san diego shootin first show with my production company, RAG TOP, at Prostart culinary competition. A high school national event, stu ...",
  "The hey was a test, I'm not a T wizard, tryin to get da bberry rollin.",
  "Hey",
  "last weeks food show run, did,vegas, atlanta, and columbus, wow, are there some wild food folks out there, thanks for great shows. sd next",
  "so sorry, i have been tryin to hit ya up with da 411, but i guess the bberry isnt deliverin.  bummer i was think i was rollin big time",
  "alright it has happened, i am finally postin on the big T.  thanks to the brooks media team, and Brandt our creative guru.  hold on tight!"
]
